# 1. Import library

In [1]:
import pandas as pd
import numpy as np

# 2. Read csv

In [233]:
df = pd.read_csv('c:/Users/Sohal/DATA scinece/Job analytics project/hello.csv')

In [278]:
df

,Designation,Name,Total_applicants,LinkedIn_Followers,Level,Involvement,Employee_count,Industry,city,state,country
0,Quality Analyst Automation,Uplers,122,668410,Full-time,Associate,5000,IT Services and IT Consulting,Jaipur,Rajasthan,India
1,QA Automation Tester,Uplers,0,668410,Full-time,Associate,5000,IT Services and IT Consulting,Jaipur,Rajasthan,India
2,Technology Analyst - Mainframe (3-5 years) - J...,Infosys,29,6457687,Full-time,Associate,10001,IT Services and IT Consulting,Jaipur,Rajasthan,India
3,Web Developer - Python,Uplers,161,668410,Full-time,Mid-Senior level,5000,IT Services and IT Consulting,Chennai,Tamil Nadu,India
4,Web Developer - Python,Uplers,75,668410,Full-time,Mid-Senior level,5000,IT Services and IT Consulting,Noida,Uttar Pradesh,India
...,...,...,...,...,...,...,...,...,...,...,...
335,Android Developer- WFH,Uplers,41,668410,Full-time,Mid-Senior level,5000,IT Services and IT Consulting,Bengaluru,Karnataka,India
336,Assistant Manager-BFS024323,Genpact,25,2258530,Full-time,Associate,10001,IT Services and IT Consulting,Bengaluru,Karnataka,India
337,Developer,Wipro,0,6404693,Full-time,Entry level,10001,IT Services and IT Consulting,Delhi,Delhi,India
338,Assurance - Consultant,EY,8,6953289,Full-time,Associate,10001,Accounting,Kolkata,West Bengal,India
339,Technical Lead,Wipro,51,6404693,Full-time,Mid-Senior level,10001,IT Services and IT Consulting,Bengaluru,Karnataka,India

# 3. Check nulls

In [235]:
df.isnull().sum()

Designation                      0
Name                             0
Location                         0
Level_and_involvement            0
Total_applicants                41
Industry_and_Employee_count      0
LinkedIn_Followers             208
dtype: int64

# 4. Check Duplicates

In [254]:
df.duplicated().sum()

6

# 5. Break down of Level_and_involvement column

In [237]:
df[['Level','Involvement']] = df['Level_and_involvement'].str.split('Â·', expand=True)

# 6. Remove noise and unwanted text from Total_applicants column

In [238]:
df['Total_applicants'] = df['Total_applicants'].str.replace(' applicants', '').str.replace(' applicant', '').fillna(0).astype(int)

# 7. Break down of Industry_and_Employee_count column

In [239]:
df[['Employee_count','Industry']] = df['Industry_and_Employee_count'].str.split('Â·', expand=True)

# 8. Remove noise and unwanted text from Employee_count column

In [240]:
df['Employee_count'] = df['Employee_count'].str.replace(',', '').str.replace(' employees', '').str.replace('+', '').str[-6:].str.replace('-', '').astype(int)

C:\Users\sohal\AppData\Local\Temp\ipykernel_12168\2752797503.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Employee_count'] = df['Employee_count'].str.replace(',', '').str.replace(' employees', '').str.replace('+', '').str[-6:].str.replace('-', '').astype(int)

# 9. Remove noise and unwanted text from LinkedIn_Followers column

In [241]:
df['LinkedIn_Followers'] = df['LinkedIn_Followers'].str.replace(' followers', '').str.replace(',', '')

# 10. Remove noise and replace data points of LinkedIn_Followers column

In [242]:
followers = {'Uplers': 668410,
             'Infosys': 6457687,
             'Sutherland': 480832,
             'Genpact': 2258530,
             'Accenture in India': 1494146,
             'Wipro': 6404693,
             'Tata Consultancy Services': 11324016,
             'UST': 724373,
             'LTIMindtree': 58311,
             'JLL': 1596438,
             'EY': 6953289,
             'Vodafone Idea Limited': 225455}

for x in followers:
    df.loc[df['Name'] == x, 'LinkedIn_Followers'] = followers[x]

# 11. Break down of Location column

In [243]:
df[['city','state','country']] = df['Location'].str.split(",", expand=True)

In [244]:
df.isnull().sum()

Designation                     0
Name                            0
Location                        0
Level_and_involvement           0
Total_applicants                0
Industry_and_Employee_count     0
LinkedIn_Followers              0
Level                           0
Involvement                     0
Employee_count                  0
Industry                        0
city                            0
state                          17
country                        31
dtype: int64

# 12. Delete all unwanted columns from data frame

In [247]:
df.drop(['Location','Level_and_involvement', 'Industry_and_Employee_count'], axis=1, inplace = True)

# 13. Drop Duplicates

In [258]:
df.drop_duplicates(inplace = True)

# 14. Jobs table

In [261]:
jobs = df[['city','state','country','Designation']].copy()

In [262]:
jobs['job_id'] = [i for i in range(1, 335)]

In [265]:
jobs = jobs[['job_id', 'Designation', 'city','state','country']].copy()

In [298]:
jobs['Company_id'] = company['Company_id']

In [309]:
jobs['Details_id'] =  [i for i in range(1001, 1335)]

In [310]:
jobs

,job_id,Designation,city,state,country,Company_id,Details_id
0,1,Quality Analyst Automation,Jaipur,Rajasthan,India,5001,1001
1,2,QA Automation Tester,Jaipur,Rajasthan,India,5001,1002
2,3,Technology Analyst - Mainframe (3-5 years) - J...,Jaipur,Rajasthan,India,5002,1003
3,4,Web Developer - Python,Chennai,Tamil Nadu,India,5001,1004
4,5,Web Developer - Python,Noida,Uttar Pradesh,India,5001,1005
...,...,...,...,...,...,...,...
335,330,Android Developer- WFH,Bengaluru,Karnataka,India,5001,1330
336,331,Assistant Manager-BFS024323,Bengaluru,Karnataka,India,5004,1331
337,332,Developer,Delhi,Delhi,India,5006,1332
338,333,Assurance - Consultant,Kolkata,West Bengal,India,5011,1333
339,334,Technical Lead,Bengaluru,Karnataka,India,5006,1334

In [319]:
jobs.to_csv('jobs.csv', index = False)

# 15. Company table

In [285]:
company = df[['Name', 'Industry', 'Employee_count', 'LinkedIn_Followers']].copy()

In [292]:
ids = dict(zip(company['Name'].unique(), [i for i in range(5001, 5013)]))

for i in ids:
    company.loc[company['Name'] == i, 'Company_id'] = int(ids[i])

In [296]:
company['Company_id'] = company['Company_id'].astype(int)

In [301]:
company.drop_duplicates(inplace = True)

In [302]:
company = company[['Company_id', 'Name', 'Industry', 'Employee_count', 'LinkedIn_Followers']].copy()

In [303]:
company

,Company_id,Name,Industry,Employee_count,LinkedIn_Followers
0,5001,Uplers,IT Services and IT Consulting,5000,668410
2,5002,Infosys,IT Services and IT Consulting,10001,6457687
14,5003,Sutherland,IT Services and IT Consulting,10001,480832
17,5004,Genpact,IT Services and IT Consulting,10001,2258530
32,5005,Accenture in India,IT Services and IT Consulting,10001,1494146
38,5006,Wipro,IT Services and IT Consulting,10001,6404693
49,5007,Tata Consultancy Services,IT Services and IT Consulting,10001,11324016
60,5008,UST,IT Services and IT Consulting,10001,724373
70,5009,LTIMindtree,IT Services and IT Consulting,10001,58311
78,5010,JLL,Real Estate,10001,1596438
92,5011,EY,Accounting,10001,6953289
116,5012,Vodafone Idea Limited,Telecommunications,10001,225455

In [318]:
company.to_csv('company.csv', index = False)

# 16. Details table

In [311]:
details = df[['Involvement', 'Level', 'Total_applicants']].copy()

In [313]:
details['Details_id'] =[i for i in range(1001, 1335)]

In [315]:
details = details[['Details_id', 'Involvement', 'Level', 'Total_applicants']]

In [316]:
details

     Details_id        Involvement       Level  Total_applicants
0          1001          Associate  Full-time                122
1          1002          Associate  Full-time                  0
2          1003          Associate  Full-time                 29
3          1004   Mid-Senior level  Full-time                161
4          1005   Mid-Senior level  Full-time                 75
..          ...                ...         ...               ...
335        1330   Mid-Senior level  Full-time                 41
336        1331          Associate  Full-time                 25
337        1332        Entry level  Full-time                  0
338        1333          Associate  Full-time                  8
339        1334   Mid-Senior level  Full-time                 51

[334 rows x 4 columns]

In [317]:
details.to_csv('details.csv', index = False)

# 17. Create and Store the main csv file for Excel analysis

In [331]:
df['job_id'] =  [i for i in range(1, 335)]

In [325]:
df['Details_id'] =  [i for i in range(1001, 1335)]

In [329]:
ids = dict(zip(df['Name'].unique(), [i for i in range(5001, 5013)]))

for i in ids:
    df.loc[df['Name'] == i, 'Company_id'] = ids[i]
df['Company_id'] = df['Company_id'].astype(int)

In [333]:
df.to_csv('main.csv', index = False)

# Thank You!